remote_work_api/app/controllers/api/v1/comment_controller.rb

  def show
    @comments = Comment.all.select {|ele| ele if ele.office_id == params["office_id"]}
---
SELECT "offices".* FROM "offices"
SELECT "comments".* FROM "comments"

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("statement", "user_name", "created_at", "updated_at", "office_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["statement", "Thomas Wolfe"], ["user_name", "Gold Coast is great"], ["created_at", "2021-02-15 19:09:31.426342"], ["updated_at", "2021-02-15 19:09:31.426342"], ["office_id", 11]]