remote_work_api/app/controllers/api/v1/office_controller.rb

SELECT "offices".* FROM "offices"
---
  def index
    @offices = Office.all

INSERT INTO "offices" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-02-10 07:28:12.810373"], ["updated_at", "2021-02-10 07:28:12.810373"]]
---
  def create
    @office = Office.new(office_params)
    if @office.save